# GetVPLrOvrdOpty

## Description
Gets the opacity for a layer override.

```pascal
FUNCTION GetVPLrOvrdOpty(
				viewportHandle : HANDLE;
				layerHandle    : HANDLE): INTEGER;
```

```python
def vs.GetVPLrOvrdOpty(viewportHandle, layerHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|layerHandle|HANDLE|The layer handle.|

## See Also
VS Functions:
SetVPLrOvrdOpty

## Version
Availability: from Vectorworks 2014

## Category
* Viewports